[
  {
    "title": "University Experience",
    "content": [
      {
        "content": "I am now in my final year at the University of South Wales studying computer science. I have studied at this university since my foundation year until now. Each year I have averaged a passing grade higher than 80%.\n\nUniversity has allowed me to further develop my computer science knowledge and to become more confident in both my critical thinking and problem solving skills that are essential for programming. Onto of these skills’ university has given me the confidence to present works to my peers, to be confident in the final project I have developed, and to be able to take critical feedback onto how to improve my work in the future.\nAt university I have had the opportunity to work in a team to develop a joint project, this required a refining of communication skills, along with leadership skills where to was required. I am much more confident in my ability to not only operate individually to achieve a task, but to allow collaborate with others to complete a task."
      }
    ]
  },
  {
    "title": "Student Course Repersentative",
    "content": [
      {
        "content": "During both my second and final year at university I was nominated and elected by my peers to be a joint year course representative. In the performance of this role as a joint representative I was required to attend meeting with my course lecturing and leadership teams to discuss issues that people in my year were facing and to campaign for chances that would be in betterment for not only students in my year but students in all of computer science at the university. In addition to this I also attended Student Union annule meetings to discus university wide issues that students are facing and to communicate ways that the Union and in extension the University could change to help struggling student.\nIn my second year at university was the first full academic that was affected by the Coronavirus 19 pandemic, the pandemic caused students experiences at university to decline with remote learning becoming the new normal for the 2020 – 2021 academic year. As course representative, I helped signpost students to the departments in the university or union that would be able to help them, I also campaigned for coursework deadlines extensions due to the new struggles students faced, along with signposting or helping with other issues students were facing, ranging from issues with lecturing materials to struggling with coping with university."
      }
    ]
  },
  {
    "title": "Foundation Year",
    "content": [
      {
        "content": "My foundation year consisted of 5 modules. These modules covered the core fundamentals to be able to complete my computer science degree. Below is further details what each moduel covered in their material."
      }
    ]
  }
]
